unmanaged/emacs/init.org
#+title: ldlework's init.el
#+startup: overview align
#+babel: :cache no
#+Options: ^:nil num:nil tags:nil
#+PROPERTY: header-args    :tangle yes

This config is best viewed in Emacs!

* bootstrap
** lexical binding
Activate help:lexical-binding for the entire config.

#+begin_src emacs-lisp
;; -*- lexical-binding: t -*-
#+end_src

** package management via straight.el
[[https://github.com/raxod502/straight.el][straight.el]] is an alternative to [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Packages.html][package.el]] with many advantages including the
ability to integrate with [[https://github.com/jwiegley/use-package][use-package]] and installing packages from git or
github.

#+begin_src emacs-lisp
  (let ((bootstrap-file (concat user-emacs-directory "straight/repos/straight.el/bootstrap.el"))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage)
    (setq straight-vc-git-default-clone-depth 1))
#+end_src

*** use-package integration
#+begin_src emacs-lisp
  (setq straight-use-package-by-default t)
  (straight-use-package 'use-package)
  (use-package git) ;; ensure we can install from git sources
#+end_src

** general dependencies
The following package dependencies are used throughout the rest of the
configuration. They provide modern APIs for working with various elisp data
structures.

#+begin_src emacs-lisp
  (require 'cl-lib)
  (require 'seq)
  (use-package f :demand t)          ;; files
  (use-package dash :demand t)       ;; lists
  (use-package ht :demand t)         ;; hash-tables
  (use-package s :demand t)          ;; strings
  (use-package a :demand t)          ;; association lists
  (use-package anaphora :demand t)   ;; anaphora
#+end_src

** boilerplate
Calculate file paths relative to various locations.

*** my/get-org-file
#+begin_src emacs-lisp
  (defun my/get-org-file (file-name)
    (concat my/org-directory file-name))
#+end_src

*** my/get-project-directory
#+begin_src emacs-lisp
  (defun my/get-project-directory (name)
    (concat my/projects-directory name))
#+end_src

*** my/get-source-directory
#+begin_src emacs-lisp
  (defun my/get-source-directory (name)
    (concat my/sources-directory name))
#+end_src

* local settings
These settings are specific to current machine.

** linux paths
#+begin_src emacs-lisp
  (when (string-equal system-type "gnu/linux")
    (defvar my/home-directory (expand-file-name "~/"))
    (defvar my/data-directory (concat my/home-directory ".emacs.d/"))
    (defvar my/projects-directory (concat my/home-directory "src/"))
    (defvar my/sources-directory (concat my/home-directory "ext/"))
    (defvar my/org-directory (concat my/home-directory "org/"))
    (defvar my/yas-directory (concat my/data-directory "yasnippet/")))
#+end_src

** windows paths
#+begin_src emacs-lisp
  (when (string-equal system-type "windows-nt")
    (defvar my/home-directory (expand-file-name "b:/"))
    (defvar my/data-directory (concat my/home-directory "Emacs/"))
    (defvar my/projects-directory (concat my/home-directory "Projects/"))
    (defvar my/sources-directory (concat my/home-directory "Sources/"))
    (defvar my/org-directory (concat my/home-directory "Syncthing/Org/"))
    (defvar my/yas-directory (concat my/data-directory "Yas/"))
    (setq linkmarks-file (concat my/org-directory "bookmarks.org")))
#+end_src

** data paths
#+begin_src emacs-lisp
  (defvar my/notes-file-name (my/get-org-file "notes.org") "Main notes file-name")
  (defvar my/bookmarks-file-name (my/get-org-file "bookmarks.org") "Main bookmarks file-name")
  (defvar my/autosaves-directory (concat my/data-directory "autosaves/") "Main bookmarks file-name")
  (defvar my/backups-directory (concat my/data-directory "backups/") "Main bookmarks file-name")
#+end_src

** external browser
#+begin_src emacs-lisp
  (setq browse-url-browser-function 'browse-url-chrome)
  (setq browse-url-chrome-program "google-chrome-stable")
#+end_src

** default zoom
#+begin_src emacs-lisp
  (setq my/default-zoom-level 4)
#+end_src

* helpers
These macros are conveinent shorthands.

** :function
Make non-interactive functions out of forms or a symbol.

e.g. =(:function (message "Hello world.")=
e.g. =(:function foobar)=

#+begin_src emacs-lisp
  (defmacro :function (&rest body)
    (if (->> body length (< 1))
        `(lambda () ,@body)
      (pcase (car body)
        ;; command symbol
        ((and v (pred commandp))
         `(lambda () (call-interactively (quote ,v))))
        ;; function symbol
        ((and v (pred symbolp))
         `(lambda () (,v)))
        ;; quoted command symbol
        ((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
         `(lambda () (call-interactively ,v)))
        ;; quoted function symbol
        ((and v (pred consp) (guard (eq 'quote (car v))))
         `(lambda () (,(cadr v))))
        ;; body forms
        (_ `(lambda () ,@body) ))))
#+end_src

** :command
Make interactive commands out of forms or a symbol.

e.g. =(:command (message "Hello world."))=
e.g. =(:command foobar)=

#+begin_src emacs-lisp
  (defmacro :command (&rest body)
    (if (->> body length (< 1))
        `(lambda () (interactive) ,@body)
      (pcase (car body)
        ;; command symbol
        ((and v (pred commandp))
         `(lambda () (interactive) (call-interactively (quote ,v))))
        ;; function symbol
        ((and v (pred symbolp))
         `(lambda () (interactive) (,v)))
        ;; quoted command symbol
        ((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
         `(lambda () (interactive) (call-interactively ,v)))
        ;; quoted function symbol
        ((and v (pred consp) (guard (eq 'quote (car v))))
         `(lambda () (interactive) (,(cadr v))))
        ;; body forms
        (_ `(lambda () (interactive) ,@body) ))))
#+end_src

** :after
Defer some forms until the given package is loaded.

e.g. =(:after org (message "Hello world"))=

#+begin_src emacs-lisp
  (defmacro :after (package &rest body)
    "A simple wrapper around `with-eval-after-load'."
    (declare (indent defun))
    `(with-eval-after-load ',package ,@body))
#+end_src

** :hook
Register some forms or a symbol with a hook.

e.g. =(:hook org-mode (message "hello world")=
e.g. (:hook org-mode foobar)

#+begin_src emacs-lisp
  (defmacro :hook (hook-name &rest body)
    "A simple wrapper around `add-hook'"
    (declare (indent defun))
    (let* ((hook-name (format "%s-hook" (symbol-name hook-name)))
           (hook-sym (intern hook-name))
           (first (car body))
           (local (eq :local first))
           (body (if local (cdr body) body))
           (first (car body))
           (body (if (consp first)
                     (if (eq (car first) 'quote)
                         first
                       `(lambda () ,@body))
                   `',first)))
      `(add-hook ',hook-sym ,body nil ,local)))
#+end_src

** :push
A wrapper around help:add-to-list.

e.g. =(:push some-list 1 2 3)=

#+begin_src emacs-lisp
  (defmacro :push (sym &rest body)
    (declare (indent defun))
    (if (consp body)
        `(setq ,sym (-snoc ,sym ,@body))
      `(add-to-list ,sym ,body)))
#+end_src

** :bind
Bind some forms or a symbol to a key.

e.g. =(:bind "C-m" (message "Hello world."=
e.g. =(:bind org-mode "C-m" (message "Hello world."))=

#+begin_src emacs-lisp
  (defmacro :bind (key &rest body)
    (declare (indent defun))
    (pcase key
      ;; kbd string resolving symbol
      ((and k (pred symbolp) (pred boundp) (guard (stringp (eval key))))
       `(global-set-key (kbd ,(eval key)) ,(eval `(:command ,@body))))
      ;; partial mode symbol
      ((pred symbolp)
       (let ((mode (intern (format "%s-map" key)))
             (key (eval (car body)))
             (body (eval `(:command ,@(cdr body)))))
         `(define-key ,mode (kbd ,key) ,body)))
      ;; global binding
      (_ `(global-set-key (kbd ,key) ,(eval `(:command ,@body))))))
#+end_src

* global keybinds
** default hydra
Open the default hydra.

#+begin_src emacs-lisp
  (:bind "<f12>" (hera-start 'hydra-default/body))
#+end_src

** major mode hydra
Open the current major-mode hydra if it exists, or the default hydra.

#+begin_src emacs-lisp
  (:bind "<f13>" my/hydra-dwim)
#+end_src

** org capture
Activate org capture.

#+begin_src emacs-lisp
  (:bind "C-c c" org-capture)
#+end_src

** magit status
Activate magit's git status.

#+begin_src emacs-lisp
  (:bind "C-x g" magit-status)
#+end_src

** treemacs
Toggle the file-browser sidebar.

#+begin_src emacs-lisp
  (:bind "M-<f12>" treemacs-dwim)
  (:bind "S-M-<f12>" (delete-window (treemacs-get-local-window)))

  (:after treemacs
    (:bind treemacs-mode "f" treemacs-toggle-autopeek)
    (:bind treemacs-mode "C-p"
      (call-interactively 'treemacs-previous-line)
      (when treemacs-autopeek-mode
	(run-at-time "0.0 sec" nil 'call-interactively 'treemacs-peek)))
    (:bind treemacs-mode "C-n"
      (call-interactively 'treemacs-next-line)
      (when treemacs-autopeek-mode
	(run-at-time "0.0 sec" nil 'call-interactively 'treemacs-peek))))
#+end_src

** meta n & p
Quickly navigate buffer blocks/paragraphs.

#+begin_src emacs-lisp
  (:bind "M-p" backward-paragraph)
  (:bind "M-n" forward-paragraph)
#+end_src

** toggle contextual help
Toggle whether help buffers auto-update.

#+begin_src emacs-lisp
  (:bind "C-c h" toggle-context-help)
#+end_src

* aesthetics
