unmanaged/emacs/init.el
;; -*- lexical-binding: t -*-

(let ((bootstrap-file (concat user-emacs-directory "straight/repos/straight.el/bootstrap.el"))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage)
  (setq straight-vc-git-default-clone-depth 1))

(setq straight-use-package-by-default t)
(straight-use-package 'use-package)
(use-package git) ;; ensure we can install from git sources

(require 'cl-lib)
(require 'seq)
(use-package f :demand t)          ;; files
(use-package dash :demand t)       ;; lists
(use-package ht :demand t)         ;; hash-tables
(use-package s :demand t)          ;; strings
(use-package a :demand t)          ;; association lists
(use-package anaphora :demand t)   ;; anaphora

(defun my/get-org-file (file-name)
  (concat my/org-directory file-name))

(defun my/get-project-directory (name)
  (concat my/projects-directory name))

(defun my/get-source-directory (name)
  (concat my/sources-directory name))

(when (string-equal system-type "gnu/linux")
  (defvar my/home-directory (expand-file-name "~/"))
  (defvar my/data-directory (concat my/home-directory ".emacs.d/"))
  (defvar my/projects-directory (concat my/home-directory "src/"))
  (defvar my/sources-directory (concat my/home-directory "ext/"))
  (defvar my/org-directory (concat my/home-directory "org/"))
  (defvar my/yas-directory (concat my/data-directory "yasnippet/")))

(when (string-equal system-type "windows-nt")
  (defvar my/home-directory (expand-file-name "b:/"))
  (defvar my/data-directory (concat my/home-directory "Emacs/"))
  (defvar my/projects-directory (concat my/home-directory "Projects/"))
  (defvar my/sources-directory (concat my/home-directory "Sources/"))
  (defvar my/org-directory (concat my/home-directory "Syncthing/Org/"))
  (defvar my/yas-directory (concat my/data-directory "Yas/"))
  (setq linkmarks-file (concat my/org-directory "bookmarks.org")))

(defvar my/notes-file-name (my/get-org-file "notes.org") "Main notes file-name")
(defvar my/bookmarks-file-name (my/get-org-file "bookmarks.org") "Main bookmarks file-name")
(defvar my/autosaves-directory (concat my/data-directory "autosaves/") "Main bookmarks file-name")
(defvar my/backups-directory (concat my/data-directory "backups/") "Main bookmarks file-name")

(setq browse-url-browser-function 'browse-url-chrome)
(setq browse-url-chrome-program "google-chrome-stable")

(setq my/default-zoom-level 4)

(defmacro :function (&rest body)
  (if (->> body length (< 1))
      `(lambda () ,@body)
    (pcase (car body)
      ;; command symbol
      ((and v (pred commandp))
       `(lambda () (call-interactively (quote ,v))))
      ;; function symbol
      ((and v (pred symbolp))
       `(lambda () (,v)))
      ;; quoted command symbol
      ((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
       `(lambda () (call-interactively ,v)))
      ;; quoted function symbol
      ((and v (pred consp) (guard (eq 'quote (car v))))
       `(lambda () (,(cadr v))))
      ;; body forms
      (_ `(lambda () ,@body) ))))

(defmacro :command (&rest body)
  (if (->> body length (< 1))
      `(lambda () (interactive) ,@body)
    (pcase (car body)
      ;; command symbol
      ((and v (pred commandp))
       `(lambda () (interactive) (call-interactively (quote ,v))))
      ;; function symbol
      ((and v (pred symbolp))
       `(lambda () (interactive) (,v)))
      ;; quoted command symbol
      ((and v (pred consp) (guard (eq 'quote (car v))) (pred commandp (cadr v)))
       `(lambda () (interactive) (call-interactively ,v)))
      ;; quoted function symbol
      ((and v (pred consp) (guard (eq 'quote (car v))))
       `(lambda () (interactive) (,(cadr v))))
      ;; body forms
      (_ `(lambda () (interactive) ,@body) ))))

(defmacro :after (package &rest body)
  "A simple wrapper around `with-eval-after-load'."
  (declare (indent defun))
  `(with-eval-after-load ',package ,@body))

(defmacro :hook (hook-name &rest body)
  "A simple wrapper around `add-hook'"
  (declare (indent defun))
  (let* ((hook-name (format "%s-hook" (symbol-name hook-name)))
         (hook-sym (intern hook-name))
         (first (car body))
         (local (eq :local first))
         (body (if local (cdr body) body))
         (first (car body))
         (body (if (consp first)
                   (if (eq (car first) 'quote)
                       first
                     `(lambda () ,@body))
                 `',first)))
    `(add-hook ',hook-sym ,body nil ,local)))

(defmacro :push (sym &rest body)
  (declare (indent defun))
  (if (consp body)
      `(setq ,sym (-snoc ,sym ,@body))
    `(add-to-list ,sym ,body)))

(defmacro :bind (key &rest body)
  (declare (indent defun))
  (pcase key
    ;; kbd string resolving symbol
    ((and k (pred symbolp) (pred boundp) (guard (stringp (eval key))))
     `(global-set-key (kbd ,(eval key)) ,(eval `(:command ,@body))))
    ;; partial mode symbol
    ((pred symbolp)
     (let ((mode (intern (format "%s-map" key)))
           (key (eval (car body)))
           (body (eval `(:command ,@(cdr body)))))
       `(define-key ,mode (kbd ,key) ,body)))
    ;; global binding
    (_ `(global-set-key (kbd ,key) ,(eval `(:command ,@body))))))

(:bind "<f12>" (hera-start 'hydra-default/body))

(:bind "<f13>" my/hydra-dwim)

(:bind "C-c c" org-capture)

(:bind "C-x g" magit-status)

(:bind "M-<f12>" treemacs-dwim)
(:bind "S-M-<f12>" (delete-window (treemacs-get-local-window)))

(:after treemacs
  (:bind treemacs-mode "f" treemacs-toggle-autopeek)
  (:bind treemacs-mode "C-p"
    (call-interactively 'treemacs-previous-line)
    (when treemacs-autopeek-mode
      (run-at-time "0.0 sec" nil 'call-interactively 'treemacs-peek)))
  (:bind treemacs-mode "C-n"
    (call-interactively 'treemacs-next-line)
    (when treemacs-autopeek-mode
      (run-at-time "0.0 sec" nil 'call-interactively 'treemacs-peek))))

(:bind "M-p" backward-paragraph)
(:bind "M-n" forward-paragraph)

(:bind "C-c h" toggle-context-help)
