unmanaged/emacs/init.org
*** context-help
#+begin_src emacs-lisp
  (defun context-help ()
    "Display function or variable at point in *Help* buffer if visible.
  Default behaviour can be turned off by setting the buffer local
  context-help to false"
    (interactive)
    (let ((rgr-symbol (symbol-at-point))) ; symbol-at-point http://www.emacswiki.org/cgi-bin/wiki/thingatpt%2B.el
      (with-current-buffer (help-buffer)
       (unless (local-variable-p 'context-help)
         (set (make-local-variable 'context-help) t))
       (if (and context-help (get-buffer-window (help-buffer))
           rgr-symbol)
         (if (fboundp  rgr-symbol)
             (describe-function rgr-symbol)
           (if (boundp  rgr-symbol) (describe-variable rgr-symbol)))))))
#+end_src

*** advise symbol eldoc
#+begin_src emacs-lisp
  (defadvice eldoc-print-current-symbol-info
    (around eldoc-show-c-tag activate)
    (cond
          ((eq major-mode 'emacs-lisp-mode) (context-help) ad-do-it)
          ((eq major-mode 'lisp-interaction-mode) (context-help) ad-do-it)
          ((eq major-mode 'apropos-mode) (context-help) ad-do-it)
          (t ad-do-it)))
#+end_src

* projectile
[[https://github.com/bbatsov/projectile][Projectile]] offers a number of features related to project interaction. It can
track the root directories and sibling files of files you edit
automatically. Combined with Helm, you can very quickly navigate related files.

Projectile's default prefix is =C-c p=

#+begin_src emacs-lisp
  (use-package projectile
    :config
    (setq projectile-enable-caching t)
    (projectile-mode t))
#+end_src

** project discovery
#+begin_src emacs-lisp
  (setq projectile-project-root-files-bottom-up
        '(".git" ".hg" "README.md" "README.org" "README")
        projectile-project-search-path my/projects-directory
        projectile-sort-order 'access-time)
  (projectile-discover-projects-in-directory my/projects-directory)
  (projectile-discover-projects-in-directory my/sources-directory)
#+end_src

* helm
Menu and selection framework for finding files, switching buffers, running
grep, etc.

#+begin_src emacs-lisp
  (use-package helm
    :config
    (helm-mode 1)
    (require 'helm-config)
    (:bind "M-x" helm-M-x)
    (:bind "C-x C-f" helm-find-files)
    (:bind "C-x b" helm-mini)
    (:bind "C-c y" helm-show-kill-ring)
    (:bind "C-x C-r" helm-recentf))
#+end_src
** ace jump
Quickly jump to any candidate with a short letter combo.

#+begin_src emacs-lisp
  (use-package ace-jump-helm-line
    :config
    (:bind helm "C-;" ace-jump-helm-line))
#+end_src

** helm-ag
#+begin_src emacs-lisp
  (use-package helm-ag)
#+end_src

** helm-descbinds
Use (=C-h b= / =kbd-helm-descbinds=) to inspect current bindings with Helm.

#+begin_src emacs-lisp
  (use-package helm-descbinds
    :commands helm-descbinds
    :config
    (:bind "C-h b" helm-descbinds))
#+end_src

** helm-flyspell
Check and correct spelling for some modes.

#+begin_src emacs-lisp
  (use-package helm-flyspell
    :commands helm-flyspell-correct
    :config
    (:bind " M-SPC" helm-flyspell-correct)
    (:hook org-mode flyspell-mode)
    (:hook text-mode flyspell-mode)
    (:hook fundamental-mode flyspell-mode))
#+end_src

** helm-projectile
Make Projectile use Helm for selections.

#+begin_src emacs-lisp
  (use-package helm-projectile
      :config
      (projectile-cleanup-known-projects)
      (setq projectile-completion-system 'helm))
#+end_src

*** projectile-readme
Open readme of the current project.

#+begin_src emacs-lisp
  (defun projectile-readme ()
      (interactive)
      (let ((file-name (-find (lambda (f) (s-matches? "^readme" f))
                              (projectile-current-project-files))))
        (find-file (concat (projectile-project-root) "/" file-name))))
#+end_src

*** hydra-projectile-dwim
Open the projectile hydra when in a project. Otherwise, select a project.

#+begin_src emacs-lisp
  (defun hydra-projectile-dwim ()
      (interactive)
      (if (string= "-" (projectile-project-name))
          (helm-projectile)
        (hydra-projectile/body)))
#+end_src

** auto full frame
Make Helm always full height.

#+begin_src emacs-lisp
  (defvar helm-full-frame-threshold 0.75)

  (when window-system
    (defun helm-full-frame-hook ()
    (let ((threshold (* helm-full-frame-threshold (x-display-pixel-height))))
      (setq helm-full-frame (< (frame-height) threshold))))

    (:hook helm-before-initialize 'helm-full-frame-hook))
#+end_src

* treemacs
Browse files in a sidebar.

#+begin_src emacs-lisp
  (use-package treemacs
    :config
    (setq treemacs-width 25
          treemacs-follow-mode -1
          treemacs-tag-follow-mode -1
          treemacs-is-never-other-window t
          treemacs-follow-after-init t
          treemacs-icon-open-png   (propertize "⊖ " 'face 'treemacs-directory-face)
          treemacs-icon-closed-png (propertize "⊕ " 'face 'treemacs-directory-face))
    (define-key treemacs-mode-map [mouse-1]
      #'treemacs-single-click-expand-action))

  (use-package treemacs-projectile)
  (use-package treemacs-magit)
#+end_src

** toggle-autopeek
#+begin_src emacs-lisp
  (setq treemacs-autopeek-mode nil)

  (defun treemacs-toggle-autopeek ()
    (interactive)
    (if treemacs-autopeek-mode
        (progn
          (setq treemacs-autopeek-mode nil)
          (message "Treemacs autopeek: OFF"))
      (setq treemacs-autopeek-mode t)
      (message "Treemacs autopeek: ON")))
#+end_src

** treemacs-dwim
#+begin_src emacs-lisp
  (defun treemacs-dwim ()
    (interactive)
    (pcase (treemacs-current-visibility)
      ((or 'none 'exists)
       (setq treemacs-previous-window (list (selected-frame) (selected-window)))
       (treemacs))
      ((and 'visible (guard (not (s-contains? "Treemacs-Scoped"
                                              (buffer-name (current-buffer))))))
       (setq treemacs-previous-window (list (selected-frame) (selected-window)))
       (treemacs-select-window))
      (_ (select-frame (car treemacs-previous-window))(select-window (cadr treemacs-previous-window)))))t
#+end_src

* yasnippet
Expand interactive snippets.

#+begin_src emacs-lisp
  (use-package yasnippet
    :config
    (setq yas-snippet-dirs `(,my/yas-directory))
    (yas-global-mode 1))
#+end_src

* magit
The best git frontend there is.

#+begin_src emacs-lisp
  (use-package magit)
#+end_src

* org-mode
A souped up markup with tasking, scheduling and aggregation features.

** straight.el fixes
Fix some issues with straight.el and org until [[https://github.com/raxod502/straight.el#installing-org-with-straightel][that is resolved]].

*** fix-org-git-version
#+begin_src emacs-lisp
  (defun fix-org-git-version ()
    "The Git version of org-mode.
    Inserted by installing org-mode or when a release is made."
    (require 'git)
    (let ((git-repo (expand-file-name
                     "straight/repos/org/" user-emacs-directory)))
      (string-trim
       (git-run "describe"
                "--match=release\*"
                "--abbrev=6"
                "HEAD"))))
#+end_src

*** fix-org-release
#+begin_src emacs-lisp
  (defun fix-org-release ()
    "The release version of org-mode.
    Inserted by installing org-mode or when a release is made."
    (require 'git)
    (let ((git-repo (expand-file-name
                     "straight/repos/org/" user-emacs-directory)))
      (string-trim
       (string-remove-prefix
        "release_"
        (git-run "describe"
                 "--match=release\*"
                 "--abbrev=0"
                 "HEAD")))))
#+end_src

** installation
#+begin_src emacs-lisp
  (use-package org
    :config
    ;; these depend on the 'straight.el fixes' above
    (defalias #'org-git-version #'fix-org-git-version)
    (defalias #'org-release #'fix-org-release)
    (require 'org-habit)
    (require 'org-indent)
    (add-to-list 'org-modules 'org-habit t)
    (require 'org-capture)
    (require 'org-tempo))
#+end_src

** look
*** theme customizations
#+begin_src emacs-lisp
  (when window-system
    (use-package org-beautify-theme
      :after (org)
      :config
      (setq org-fontify-whole-heading-line t)
      (setq org-fontify-quote-and-verse-blocks t)
      (setq org-hide-emphasis-markers t)))
#+end_src

*** pretty symbols
Add a hook to set the pretty symbols alist.

#+begin_src emacs-lisp
  (setq my/org-pretty-symbols nil)
  (:hook org-mode
    (setq-local prettify-symbols-alist my/org-pretty-symbols))
#+end_src
*** indent by header level
Hide the heading asterisks. Instead indent headings based on depth.

#+begin_src emacs-lisp
  (:hook org-mode 'org-indent-mode)
#+end_src

*** pretty heading bullets
Use nice unicode bullets instead of the default asterisks.

#+begin_src emacs-lisp
  (use-package org-bullets
    :init
    (:hook org-mode 'org-bullets-mode)
    :config
    (setq org-bullets-bullet-list '("◉" "○" "✸" "•")))
#+end_src

