unmanaged/emacs/init.el

(defun context-help ()
  "Display function or variable at point in *Help* buffer if visible.
Default behaviour can be turned off by setting the buffer local
context-help to false"
  (interactive)
  (let ((rgr-symbol (symbol-at-point))) ; symbol-at-point http://www.emacswiki.org/cgi-bin/wiki/thingatpt%2B.el
    (with-current-buffer (help-buffer)
     (unless (local-variable-p 'context-help)
       (set (make-local-variable 'context-help) t))
     (if (and context-help (get-buffer-window (help-buffer))
         rgr-symbol)
       (if (fboundp  rgr-symbol)
           (describe-function rgr-symbol)
         (if (boundp  rgr-symbol) (describe-variable rgr-symbol)))))))

(defadvice eldoc-print-current-symbol-info
  (around eldoc-show-c-tag activate)
  (cond
        ((eq major-mode 'emacs-lisp-mode) (context-help) ad-do-it)
        ((eq major-mode 'lisp-interaction-mode) (context-help) ad-do-it)
        ((eq major-mode 'apropos-mode) (context-help) ad-do-it)
        (t ad-do-it)))

(use-package projectile
  :config
  (setq projectile-enable-caching t)
  (projectile-mode t))

(setq projectile-project-root-files-bottom-up
      '(".git" ".hg" "README.md" "README.org" "README")
      projectile-project-search-path my/projects-directory
      projectile-sort-order 'access-time)
(projectile-discover-projects-in-directory my/projects-directory)
(projectile-discover-projects-in-directory my/sources-directory)

(use-package helm
  :config
  (helm-mode 1)
  (require 'helm-config)
  (:bind "M-x" helm-M-x)
  (:bind "C-x C-f" helm-find-files)
  (:bind "C-x b" helm-mini)
  (:bind "C-c y" helm-show-kill-ring)
  (:bind "C-x C-r" helm-recentf))

(use-package ace-jump-helm-line
  :config
  (:bind helm "C-;" ace-jump-helm-line))

(use-package helm-ag)

(use-package helm-descbinds
  :commands helm-descbinds
  :config
  (:bind "C-h b" helm-descbinds))

(use-package helm-flyspell
  :commands helm-flyspell-correct
  :config
  (:bind " M-SPC" helm-flyspell-correct)
  (:hook org-mode flyspell-mode)
  (:hook text-mode flyspell-mode)
  (:hook fundamental-mode flyspell-mode))

(use-package helm-projectile
    :config
    (projectile-cleanup-known-projects)
    (setq projectile-completion-system 'helm))

(defun projectile-readme ()
    (interactive)
    (let ((file-name (-find (lambda (f) (s-matches? "^readme" f))
                            (projectile-current-project-files))))
      (find-file (concat (projectile-project-root) "/" file-name))))

(defun hydra-projectile-dwim ()
    (interactive)
    (if (string= "-" (projectile-project-name))
        (helm-projectile)
      (hydra-projectile/body)))

(defvar helm-full-frame-threshold 0.75)

(when window-system
  (defun helm-full-frame-hook ()
  (let ((threshold (* helm-full-frame-threshold (x-display-pixel-height))))
    (setq helm-full-frame (< (frame-height) threshold))))

  (:hook helm-before-initialize 'helm-full-frame-hook))

(use-package treemacs
  :config
  (setq treemacs-width 25
        treemacs-follow-mode -1
        treemacs-tag-follow-mode -1
        treemacs-is-never-other-window t
        treemacs-follow-after-init t
        treemacs-icon-open-png   (propertize "⊖ " 'face 'treemacs-directory-face)
        treemacs-icon-closed-png (propertize "⊕ " 'face 'treemacs-directory-face))
  (define-key treemacs-mode-map [mouse-1]
    #'treemacs-single-click-expand-action))

(use-package treemacs-projectile)
(use-package treemacs-magit)

(setq treemacs-autopeek-mode nil)

(defun treemacs-toggle-autopeek ()
  (interactive)
  (if treemacs-autopeek-mode
      (progn
        (setq treemacs-autopeek-mode nil)
        (message "Treemacs autopeek: OFF"))
    (setq treemacs-autopeek-mode t)
    (message "Treemacs autopeek: ON")))

(defun treemacs-dwim ()
  (interactive)
  (pcase (treemacs-current-visibility)
    ((or 'none 'exists)
     (setq treemacs-previous-window (list (selected-frame) (selected-window)))
     (treemacs))
    ((and 'visible (guard (not (s-contains? "Treemacs-Scoped"
                                            (buffer-name (current-buffer))))))
     (setq treemacs-previous-window (list (selected-frame) (selected-window)))
     (treemacs-select-window))
    (_ (select-frame (car treemacs-previous-window))(select-window (cadr treemacs-previous-window)))))t

(use-package yasnippet
  :config
  (setq yas-snippet-dirs `(,my/yas-directory))
  (yas-global-mode 1))

(use-package magit)

(defun fix-org-git-version ()
  "The Git version of org-mode.
  Inserted by installing org-mode or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (git-run "describe"
              "--match=release\*"
              "--abbrev=6"
              "HEAD"))))

(defun fix-org-release ()
  "The release version of org-mode.
  Inserted by installing org-mode or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (string-remove-prefix
      "release_"
      (git-run "describe"
               "--match=release\*"
               "--abbrev=0"
               "HEAD")))))

(use-package org
  :config
  ;; these depend on the 'straight.el fixes' above
  (defalias #'org-git-version #'fix-org-git-version)
  (defalias #'org-release #'fix-org-release)
  (require 'org-habit)
  (require 'org-indent)
  (add-to-list 'org-modules 'org-habit t)
  (require 'org-capture)
  (require 'org-tempo))

(when window-system
  (use-package org-beautify-theme
    :after (org)
    :config
    (setq org-fontify-whole-heading-line t)
    (setq org-fontify-quote-and-verse-blocks t)
    (setq org-hide-emphasis-markers t)))

(setq my/org-pretty-symbols nil)
(:hook org-mode
  (setq-local prettify-symbols-alist my/org-pretty-symbols))

(:hook org-mode 'org-indent-mode)

(use-package org-bullets
  :init
  (:hook org-mode 'org-bullets-mode)
  :config
  (setq org-bullets-bullet-list '("◉" "○" "✸" "•")))

(:push my/org-pretty-symbols
  '("[#A]" . "⇑")
  '("[#C]" . "⇓"))
