unmanaged/emacs/init.org
*** pretty priority cookies
Instead of the default =[#A]= and =[#C]= priority cookies, use little unicode arrows to
indicate high and low priority. =[#B]=, which is the same as no priority, is shown as
normal.

#+begin_src emacs-lisp
  (:push my/org-pretty-symbols
    '("[#A]" . "⇑")
    '("[#C]" . "⇓"))
#+end_src

#+begin_src emacs-lisp
  ;; only show priority cookie symbols on headings.
  (defun nougat/org-pretty-compose-p (start end match)
    (if (or (string= match "[#A]") (string= match "[#C]"))
        ;; prettify asterisks in headings
        (org-match-line org-outline-regexp-bol)
      ;; else rely on the default function
      (funcall #'prettify-symbols-default-compose-p start end match)))


  (:hook org-mode (setq-local prettify-symbols-compose-predicate
                              #'nougat/org-pretty-compose-p))
#+end_src

*** pretty heading ellipsis
Show a little arrow for collapsed headings.

#+begin_src emacs-lisp
  (:after org
    (setq org-ellipsis " ▿"))
#+end_src

*** prettify source blocks
#+begin_src emacs-lisp
  (:push my/org-pretty-symbols
    '("#+begin_src" . ">>")
    '("#+end_src" . "·"))
#+end_src
*** dynamic tag position
#+begin_src emacs-lisp
  (defun org-realign-tags ()
    (interactive)
    (setq org-tags-column (- 0 (window-width)))
    (org-align-tags t))

  ;; (:hook window-configuration-change 'org-realign-tags)
#+end_src

** feel
*** show all headings on startup
#+begin_src emacs-lisp
  (setq org-startup-folded 'content)
#+end_src

*** don't fold blocks on open
#+begin_src emacs-lisp
  (setq org-hide-block-startup nil)
#+end_src

*** auto-fill paragraphs
#+begin_src emacs-lisp
  (:hook org-mode 'turn-on-auto-fill)
#+end_src

*** resepect content on insert
Don't split existing entries when inserting a new heading.

#+begin_src emacs-lisp
  (setq org-insert-heading-respect-content nil)
#+end_src

*** use helpful for help links
#+begin_src emacs-lisp
  (advice-add 'org-link--open-help :override
              (lambda (path) (helpful-symbol (intern path))))
#+end_src
*** ensure one-line between headers
When you save, this section will ensure that there is a one-line space between each
heading. This helps with the background color of code-blocks not showing up on folded
headings.

#+begin_src emacs-lisp
  ;; (defun my/org-no-line-before-headlines ()
  ;;   (beginning-of-buffer)
  ;;   (while (re-search-forward "\n\\{3,\\}\\*" nil t)
  ;;     (replace-match "\n\n*")))

  ;; (defun my/org-one-line-after-headlines ()
  ;;   (beginning-of-buffer)
  ;;   (while (re-search-forward "^\\*+.*\n\\{2,\\}" nil t)
  ;;     (outline-previous-heading)
  ;;     (end-of-line)
  ;;     (forward-char)
  ;;     (while (looking-at "^[:space:]*$")
  ;;       (kill-line))))

  ;; (defun my/org-trim-headlines ()
  ;;   (let ((markers nil))
  ;;     (org-element-map (org-element-parse-buffer) '(headline)
  ;;       (lambda (paragraph)
  ;;         (let ((contents-end (org-element-property :contents-end paragraph))
  ;;               (post-blank (org-element-property :post-blank paragraph))
  ;;               (marker (make-marker)))
  ;;           (goto-char contents-end)
  ;;           (unless (eq 0 post-blank)
  ;;             (set-marker marker contents-end)
  ;;             (setq markers (append markers (list (cons marker post-blank))))))))
  ;;     (--each markers (save-excursion
  ;;                       (goto-char (car it))
  ;;                       (kill-line (- (cdr it) 1))))))

  ;; (defun my/org-element-type-at-point ()
  ;;   (car (org-element-at-point)))

  ;; (defun my/org-point-at-headline ()
  ;;   (let* ((element-type (my/org-element-type-at-point)))
  ;;     (eq 'headline element-type)))

  ;; (defun my/org-mark-elements (data types marker-prop &rest props)
  ;;   (let ((markers nil))
  ;;     (org-element-map data types
  ;;       (lambda (element)
  ;;         (let* ((marker (make-marker))
  ;;                (marker-pos (org-element-property marker-prop element))
  ;;                (prop-map (make-hash-table)))
  ;;           (when marker-pos
  ;;             (set-marker marker marker-pos)
  ;;             (--each props (map-put! prop-map it (org-element-property it element)))
  ;;             (setq markers (append markers (list (cons marker prop-map))))))))

  ;;     markers))

  ;; (defun my/org-visit-markers (markers)
  ;;   (--each markers
  ;;     (goto-char (car it))
  ;;     (sit-for 1)))

  ;; (defun my/org-visit-elements (types &optional data)
  ;;   (setq data (or data (org-element-parse-buffer)))
  ;;   (my/org-visit-markers (my/org-mark-elements data types :begin)))

  ;; (defun my/org-trim-headlines ()
  ;;   (save-excursion
  ;;     (--each (my/org-mark-elements (org-element-parse-buffer) '(headline) :begin :pre-blank)
  ;;       (let* ((prop-map (cdr it))
  ;;              (pre-blank (map-elt prop-map :pre-blank)))
  ;;         (when (> pre-blank 1)
  ;;           (goto-char (car it))
  ;;           (end-of-line)
  ;;           (forward-char)
  ;;           (sit-for 1)
  ;;           (kill-line (max 0 pre-blank)))))))

  ;; (defun my/org-trim-paragraphs ()
  ;;   (save-excursion
  ;;     (--each (my/org-mark-elements (org-element-parse-buffer) '(paragraph section src-block) :contents-end :post-blank)
  ;;       (let* ((prop-map (cdr it))
  ;;              (post-blank (map-elt prop-map :post-blank)))
  ;;         (if (> post-blank 1)
  ;;             (progn (goto-char (car it))
  ;;              (sit-for 1)
  ;;              (kill-line (max 0 (- post-blank 1))))
  ;;           (when (eq 0 post-blank)
  ;;             (goto-char (car it))
  ;;             (end-of-line)
  ;;             (forward-char)
  ;;             (open-line 1)))))))

  ;; (defun my/org-cleanup ()
  ;;   (interactive)
  ;;   (my/org-trim-headlines)
  ;;   (my/org-trim-paragraphs))


  ;; (:after org
  ;;   (:hook org-mode
  ;;     (:hook before-save :local
  ;;       (my/org-cleanup))))
#+end_src

** todo keywords
*** boilerplate
**** make-state-model
#+begin_src emacs-lisp
  (defun todo-make-state-model (name key props)
    (append (list :name name :key key) props))
#+end_src
**** parse-state-data
#+begin_src emacs-lisp
  (defun todo-parse-state-data (state-data)
    (-let* (((name second &rest) state-data)
            ((key props) (if (stringp second)
                             (list second (cddr state-data))
                           (list nil (cdr state-data)))))
      (todo-make-state-model name key props)))
#+end_src
**** make-sequence-mode
#+begin_src emacs-lisp
  (defun todo-make-sequence-model (states)
    (mapcar 'todo-parse-state-data states))
#+end_src
**** parse-sequences-data
#+begin_src emacs-lisp
  (defun todo-parse-sequences-data (sequences-data)
    (mapcar 'todo-make-sequence-model sequences-data))
#+end_src
**** todo-keyword-name
#+begin_src emacs-lisp
  (defun todo-keyword-name (name key)
    (if key (format "%s(%s)" name key) name))
#+end_src
**** keyword-name-forstate
#+begin_src emacs-lisp
  (defun todo-keyword-name-for-state (state)
    (todo-keyword-name (plist-get state :name)
                       (plist-get state :key)))
#+end_src
**** is-done-state
#+begin_src emacs-lisp
  (defun todo-is-done-state (state)
    (equal t (plist-get state :done-state)))
#+end_src
**** is-not-done-state
#+begin_src emacs-lisp
  (defun todo-is-not-done-state (state)
    (equal nil (plist-get state :done-state)))
#+end_src
**** org-sequence
#+begin_src emacs-lisp
  (defun todo-org-sequence (states)
    (let ((active (seq-filter 'todo-is-not-done-state states))
          (inactive (seq-filter 'todo-is-done-state states)))
      (append '(sequence)
              (mapcar 'todo-keyword-name-for-state active)
              '("|")
              (mapcar 'todo-keyword-name-for-state inactive))))
#+end_src
**** org-todo-keywords
#+begin_src emacs-lisp
  (defun todo-org-todo-keywords (sequences)
    (mapcar 'todo-org-sequence (todo-parse-sequences-data sequences)))
  ;; (todo-org-todo-keywords todo-keywords)
#+end_src
**** org-todo-keyword-faces
#+begin_src emacs-lisp
  (defun todo-org-todo-keyword-faces (sequences)
    (cl-loop for sequence in (todo-parse-sequences-data sequences)
             append (cl-loop for state in sequence
                             for name = (plist-get state :name)
                             for face = (plist-get state :face)
                             collect (cons name face))))
  ;; (todo-org-todo-keyword-faces todo-keywords)
#+end_src
**** prettify-symbols-alist
#+begin_src emacs-lisp
  (defun todo-prettify-symbols-alist (sequences)
    (cl-loop for sequence in (todo-parse-sequences-data sequences)
             append (cl-loop for state in sequence
                             for name = (plist-get state :name)
                             for icon = (plist-get state :icon)
                             collect (cons name icon))))
  ;; (todo-prettify-symbols-alist todo-keywords)
#+end_src
