unmanaged/emacs/init.el

;; only show priority cookie symbols on headings.
(defun nougat/org-pretty-compose-p (start end match)
  (if (or (string= match "[#A]") (string= match "[#C]"))
      ;; prettify asterisks in headings
      (org-match-line org-outline-regexp-bol)
    ;; else rely on the default function
    (funcall #'prettify-symbols-default-compose-p start end match)))


(:hook org-mode (setq-local prettify-symbols-compose-predicate
                            #'nougat/org-pretty-compose-p))

(:after org
  (setq org-ellipsis " ▿"))

(:push my/org-pretty-symbols
  '("#+begin_src" . ">>")
  '("#+end_src" . "·"))

(defun org-realign-tags ()
  (interactive)
  (setq org-tags-column (- 0 (window-width)))
  (org-align-tags t))

;; (:hook window-configuration-change 'org-realign-tags)

(setq org-startup-folded 'content)

(setq org-hide-block-startup nil)

(:hook org-mode 'turn-on-auto-fill)

(setq org-insert-heading-respect-content nil)

(advice-add 'org-link--open-help :override
            (lambda (path) (helpful-symbol (intern path))))

;; (defun my/org-no-line-before-headlines ()
;;   (beginning-of-buffer)
;;   (while (re-search-forward "\n\\{3,\\}\\*" nil t)
;;     (replace-match "\n\n*")))

;; (defun my/org-one-line-after-headlines ()
;;   (beginning-of-buffer)
;;   (while (re-search-forward "^\\*+.*\n\\{2,\\}" nil t)
;;     (outline-previous-heading)
;;     (end-of-line)
;;     (forward-char)
;;     (while (looking-at "^[:space:]*$")
;;       (kill-line))))

;; (defun my/org-trim-headlines ()
;;   (let ((markers nil))
;;     (org-element-map (org-element-parse-buffer) '(headline)
;;       (lambda (paragraph)
;;         (let ((contents-end (org-element-property :contents-end paragraph))
;;               (post-blank (org-element-property :post-blank paragraph))
;;               (marker (make-marker)))
;;           (goto-char contents-end)
;;           (unless (eq 0 post-blank)
;;             (set-marker marker contents-end)
;;             (setq markers (append markers (list (cons marker post-blank))))))))
;;     (--each markers (save-excursion
;;                       (goto-char (car it))
;;                       (kill-line (- (cdr it) 1))))))

;; (defun my/org-element-type-at-point ()
;;   (car (org-element-at-point)))

;; (defun my/org-point-at-headline ()
;;   (let* ((element-type (my/org-element-type-at-point)))
;;     (eq 'headline element-type)))

;; (defun my/org-mark-elements (data types marker-prop &rest props)
;;   (let ((markers nil))
;;     (org-element-map data types
;;       (lambda (element)
;;         (let* ((marker (make-marker))
;;                (marker-pos (org-element-property marker-prop element))
;;                (prop-map (make-hash-table)))
;;           (when marker-pos
;;             (set-marker marker marker-pos)
;;             (--each props (map-put! prop-map it (org-element-property it element)))
;;             (setq markers (append markers (list (cons marker prop-map))))))))

;;     markers))

;; (defun my/org-visit-markers (markers)
;;   (--each markers
;;     (goto-char (car it))
;;     (sit-for 1)))

;; (defun my/org-visit-elements (types &optional data)
;;   (setq data (or data (org-element-parse-buffer)))
;;   (my/org-visit-markers (my/org-mark-elements data types :begin)))

;; (defun my/org-trim-headlines ()
;;   (save-excursion
;;     (--each (my/org-mark-elements (org-element-parse-buffer) '(headline) :begin :pre-blank)
;;       (let* ((prop-map (cdr it))
;;              (pre-blank (map-elt prop-map :pre-blank)))
;;         (when (> pre-blank 1)
;;           (goto-char (car it))
;;           (end-of-line)
;;           (forward-char)
;;           (sit-for 1)
;;           (kill-line (max 0 pre-blank)))))))

;; (defun my/org-trim-paragraphs ()
;;   (save-excursion
;;     (--each (my/org-mark-elements (org-element-parse-buffer) '(paragraph section src-block) :contents-end :post-blank)
;;       (let* ((prop-map (cdr it))
;;              (post-blank (map-elt prop-map :post-blank)))
;;         (if (> post-blank 1)
;;             (progn (goto-char (car it))
;;              (sit-for 1)
;;              (kill-line (max 0 (- post-blank 1))))
;;           (when (eq 0 post-blank)
;;             (goto-char (car it))
;;             (end-of-line)
;;             (forward-char)
;;             (open-line 1)))))))

;; (defun my/org-cleanup ()
;;   (interactive)
;;   (my/org-trim-headlines)
;;   (my/org-trim-paragraphs))


;; (:after org
;;   (:hook org-mode
;;     (:hook before-save :local
;;       (my/org-cleanup))))

(defun todo-make-state-model (name key props)
  (append (list :name name :key key) props))

(defun todo-parse-state-data (state-data)
  (-let* (((name second &rest) state-data)
          ((key props) (if (stringp second)
                           (list second (cddr state-data))
                         (list nil (cdr state-data)))))
    (todo-make-state-model name key props)))

(defun todo-make-sequence-model (states)
  (mapcar 'todo-parse-state-data states))

(defun todo-parse-sequences-data (sequences-data)
  (mapcar 'todo-make-sequence-model sequences-data))

(defun todo-keyword-name (name key)
  (if key (format "%s(%s)" name key) name))

(defun todo-keyword-name-for-state (state)
  (todo-keyword-name (plist-get state :name)
                     (plist-get state :key)))

(defun todo-is-done-state (state)
  (equal t (plist-get state :done-state)))

(defun todo-is-not-done-state (state)
  (equal nil (plist-get state :done-state)))

(defun todo-org-sequence (states)
  (let ((active (seq-filter 'todo-is-not-done-state states))
        (inactive (seq-filter 'todo-is-done-state states)))
    (append '(sequence)
            (mapcar 'todo-keyword-name-for-state active)
            '("|")
            (mapcar 'todo-keyword-name-for-state inactive))))

(defun todo-org-todo-keywords (sequences)
  (mapcar 'todo-org-sequence (todo-parse-sequences-data sequences)))
;; (todo-org-todo-keywords todo-keywords)

(defun todo-org-todo-keyword-faces (sequences)
  (cl-loop for sequence in (todo-parse-sequences-data sequences)
           append (cl-loop for state in sequence
                           for name = (plist-get state :name)
                           for face = (plist-get state :face)
                           collect (cons name face))))
;; (todo-org-todo-keyword-faces todo-keywords)

(defun todo-prettify-symbols-alist (sequences)
  (cl-loop for sequence in (todo-parse-sequences-data sequences)
           append (cl-loop for state in sequence
                           for name = (plist-get state :name)
                           for icon = (plist-get state :icon)
                           collect (cons name icon))))
;; (todo-prettify-symbols-alist todo-keywords)
