unmanaged/emacs/init.org
**** finalize-agenda-for-state
#+begin_src emacs-lisp
  (defun todo-finalize-agenda-for-state (state)
    (-let (((&plist :name :icon :face) state))
      (beginning-of-buffer)
      (while (search-forward name nil 1)
        (let* ((line-props (text-properties-at (point)))
               (line-props (org-plist-delete line-props 'face)))
          (call-interactively 'set-mark-command)
          (search-backward name)
          (call-interactively 'kill-region)
          (let ((symbol-pos (point)))
            (insert icon)
            (beginning-of-line)
            (let ((start (point))
                  (end (progn (end-of-line) (point))))
              (add-text-properties start end line-props)
              (add-face-text-property symbol-pos (+ 1 symbol-pos) face))))))
    (beginning-of-buffer)
    (replace-regexp "[[:space:]]+[=]+" ""))
#+end_src

*** keywords
#+begin_src emacs-lisp
  (setq todo-keywords
        ;; normal workflow
        '((("DOING" "d" :icon "🏃" :face org-doing-face)
           ("TODO" "t" :icon "□ " :face org-todo-face)
           ("DONE" "D" :icon "✓ " :face org-done-face :done-state t))
          ;; auxillary states
          (("SOON" "s" :icon "❗ " :face org-soon-face)
           ("SOMEDAY" "S" :icon "🛌" :face org-doing-face)))
        org-todo-keywords (todo-org-todo-keywords todo-keywords)
        org-todo-keyword-faces (todo-org-todo-keyword-faces todo-keywords))

  (--map (:push my/org-pretty-symbols it)
         (todo-prettify-symbols-alist todo-keywords))
#+end_src

*** org agenda finalization
#+begin_src emacs-lisp
  (setq my/todo-sequences-data (todo-parse-sequences-data todo-keywords))
  (:hook org-agenda-finalize
    (--each my/todo-sequences-data
      (-each it 'todo-finalize-agenda-for-state)))
#+end_src
*** sorting
#+begin_src emacs-lisp
  (defun my/todo-sort (a b)
    (let* ((a-state (get-text-property 0 'todo-state a))
           (b-state (get-text-property 0 'todo-state b))
           (a-index (-elem-index a-state todo-keyword-order))
           (b-index (-elem-index b-state todo-keyword-order)))
      (pcase (- b-index a-index)
        ((and v (guard (< 0 v))) 1)
        ((and v (guard (> 0 v))) -1)
        (default nil))))

  (setq org-agenda-cmp-user-defined 'my/todo-sort
        todo-keyword-order '("DOING" "SOON" "TODO" "SOMEDAY" "DONE"))
#+end_src

** org-capture
*** org-directory
help:org-directory is the default location for captures.
#+begin_src emacs-lisp
  (setq org-directory my/org-directory)
#+end_src
*** set default notes file
#+begin_src emacs-lisp
  (setq org-default-notes-file my/notes-file-name)
#+end_src
*** automatically visit new capture
#+begin_src emacs-lisp
  (:after org
    (:push org-capture-after-finalize-hook 'org-capture-goto-last-stored))
#+end_src
*** capture templates
#+begin_src emacs-lisp
#+end_src

** org-babel
*** babel languages
**** ob-csharp
#+begin_src emacs-lisp
  (use-package ob-csharp
    :straight (ob-csharp :type git
                         :host github
                         :repo "thomas-villagers/ob-csharp"
                         :files ("src/ob-csharp.el"))
    :config
    (:push org-babel-load-languages '(csharp . t)))
#+end_src
**** ob-fsharp
#+begin_src emacs-lisp
  (use-package ob-fsharp
    :straight (ob-fsharp :type git
                         :host github
                         :repo "zweifisch/ob-fsharp"
                         :files ("ob-fsharp.el"))
    :config
    (:push org-babel-load-languages '(fsharp . t)))
#+end_src
*** enable languages
#+begin_src emacs-lisp
  (setq org-babel-load-languages
        '((shell . t)
          (emacs-lisp . t)
          (python . t)
          (js . t)
          (csharp . t)
          (fsharp . t)))
#+end_src

*** default header args
#+begin_src emacs-lisp
  (:after org
    (setq org-babel-default-header-args
          '((:session . "none")
            (:results . "replace")
            (:exports . "code")
            (:cache . "no")
            (:noweb . "no")
            (:hlines . "no")
            (:tangle . "no"))))
#+end_src

*** security
Disable prompts for evaluating org-mode links.
#+begin_src emacs-lisp
  (progn
    (setq org-confirm-babel-evaluate nil)
    (setq org-confirm-elisp-link-function nil)
    (setq org-confirm-shell-link-function nil)
    (setq safe-local-variable-values '((org-confirm-elisp-link-function . nil))))
#+end_src
*** install babel handlers
#+begin_src emacs-lisp
  (:hook after-init
    (org-babel-do-load-languages 'org-babel-load-languages
                                 org-babel-load-languages))
#+end_src

** helm-org
#+begin_src emacs-lisp
  (use-package helm-org)
#+end_src
** helm-org-rifle
Quickly search through the current org buffer.

#+begin_src emacs-lisp
  (use-package helm-org-rifle)
#+end_src
** org-projectile
#+begin_src emacs-lisp
  (use-package org-projectile
    :config
    (org-projectile-per-project)
    (setq org-projectile-per-project-filepath "notes.org")
    (:push org-capture-templates
      (org-projectile-project-todo-entry
       :capture-character "l"
       :capture-heading "Linked Project TODO"))
    (:push org-capture-templates
      (org-projectile-project-todo-entry
       :capture-character "p")))

#+end_src

*** org-projectile-helm
#+begin_src emacs-lisp
  (use-package org-projectile-helm
    :after org-projectile
    :bind (("C-c n p" . org-projectile-helm-template-or-project)))
#+end_src

** super-agenda
Provides better organization of the agenda view.

*** narrow agenda by header
Hitting =C-<return>= on a header will narrow the agenda to that file.

#+begin_src emacs-lisp
  (setq my/org-agenda-nested nil)
  (define-key org-agenda-mode-map (kbd "C-<return>")
    (lambda () (interactive)
      (unless my/org-agenda-nested
        (setq my/org-agenda-nested t)
        (with-current-buffer (marker-buffer (get-text-property (point) 'org-marker))
          (org-agenda nil "a" "<")))))

  ;; pop back to main agenda view, or quit
  (defun my/org-agenda-quit ()
    (interactive)
    (org-agenda-quit)
    (when my/org-agenda-nested
      (setq my/org-agenda-nested nil)
      (org-agenda nil "a")))

  (define-key org-agenda-mode-map (kbd "q") 'my/org-agenda-quit)
#+end_src
*** transform agenda items
Clean up the item display, including the project and file names.

#+begin_src emacs-lisp
  (defun org-agenda-transformer (it)
    (-let* (((blank todo rest) (s-split-up-to
                                "[[:blank:]]+"
                                (substring-no-properties it) 2))
            (buffer-name (->> it
                              (get-text-property 0 'org-marker)
                              (marker-buffer)
                              (buffer-file-name)))
            (file-name (->> buffer-name f-filename))
            (project-name (->> buffer-name (f-parent) (f-base)))
            (text (s-collapse-whitespace
                   (format "  %s %s/%s: %s" todo project-name file-name rest))))
      (set-text-properties 0 (- (length text) 1) (text-properties-at 0 it) text)
      text))

  (defun org-agenda-schedule-transformer (it)
    (-let* (((_ _ _ rest) (s-split-up-to
                           "[[:blank:]]+"
                           (substring-no-properties it) 3))
            (todo (get-text-property 0 'todo-state it))
            (buffer-name (->> it
                              (get-text-property 0 'org-marker)
                              (marker-buffer)
                              (buffer-file-name)))
            (file-name (->> buffer-name f-filename))
            (project-name (->> buffer-name (f-parent) (f-base)))
            (text (s-collapse-whitespace
                   (format "  %s %s/%s: %s" todo project-name file-name rest))))
      (set-text-properties 0 (length text) (text-properties-at 0 it) text)
      text))
#+end_src

*** group items by project & filename
#+begin_src emacs-lisp
  (defun org-agenda-group-items (item)
    (-when-let* ((new-marker (make-marker))
                 (marker (or (get-text-property 0 'org-marker item)
                             (get-text-property 0 'org-hd-marker item)))
                 (file-path (->> marker marker-buffer buffer-file-name))
                 (file-name (f-filename file-path))
                 (directory (f-dirname file-path))
                 (directory-name (f-filename
                                  (or (projectile-root-bottom-up file-path) directory)))
                 (heading (s-replace "//" "/" (format "%s/%s" directory-name file-name))))
      (set-marker new-marker 1 (marker-buffer marker))
      (propertize heading 'org-marker new-marker 'org-hd-marker new-marker)))
#+end_src

