unmanaged/emacs/init.el

(defun get-agenda-commands ()
  '(("a" "agenda view"
     ((agenda "" ((org-agenda-overriding-header "")
                  (org-agenda-span 'day)
                  (org-super-agenda-groups
                   '((:name "Today"
                            :transformer (org-agenda-schedule-transformer it)
                            :scheduled today)
                     (:name "Overdue"
                            :transformer (org-agenda-schedule-transformer it)
                            :scheduled past)))))
      (alltodo "" ((org-agenda-overriding-header "")
                   (org-super-agenda-groups
                    '(;; (:name "Today" :time-grid t :date today :todo "TODAY" :scheduled today)
                      (:discard (:scheduled today :scheduled past))
                      (:name "Active" :todo "DOING" :transformer (org-agenda-transformer it))
                      (:name "Important" :tag "Important" :priority "A")
                      (:name "Some Day" :todo "SOMEDAY" :transformer (org-agenda-transformer it) :order 5)
                      (:name "Todo" :auto-map org-agenda-group-items :todo "TODO")))))
      ))))

(use-package org-super-agenda
  :config
  (setq org-agenda-custom-commands (get-agenda-commands))
  (org-super-agenda-mode))

(setq org-agenda-todo-keyword-format ""
      org-agenda-prefix-format '((todo . "  %(org-get-todo-state)")))

(setq org-agenda-sorting-strategy
      '((agenda habit-down time-up priority-down category-keep)
        (todo user-defined-down priority-down category-keep)
        (tags priority-down category-keep)
        (search category-keep)))

(setq org-agenda-files (->> (append (f-glob (my/get-org-file "*/*.org"))
                                    (f-glob (my/get-project-directory "*/*.org")))
                            (-filter 'f-exists?)))

(use-package org-journal
  :config
  (setq org-journal-dir (concat my/org-directory "journal"))
  (setq org-journal-file-type 'weekly)
  (setq org-journal-start-on-weekday 5))

(use-package org-fragtog
  :config
  (:hook org-mode 'org-fragtog-mode))

(use-package linkmarks
  :straight (linkmarks :type git :host github :repo "dustinlacewell/linkmarks"))

(use-package org-ql)

(use-package helm-org-walk
  :straight (helm-org-walk :type git :host github :repo "dustinlacewell/helm-org-walk"))

(load-file (expand-file-name "~/src/org-ls/org-ls.el"))

(setq safe-local-variable-values '((org-confirm-elisp-link-function . nil)))

(use-package outshine
  :init (defvar outline-minor-mode-prefix "\M-#")
  :config (setq outshine-use-speed-commands t)
  :hook ((emacs-lisp-mode . outshine-mode) (nix-mode . outshine-mode)))

(use-package flycheck)

(use-package macrostep
  :straight (macrostep :type git :host github :repo "joddie/macrostep")
  :config
  (:bind emacs-lisp-mode "C-c e" macrostep-expand))

(use-package lispy
  :init
  (:hook emacs-lisp-mode (lispy-mode 1))
  (:hook lisp-interaction-mode (lispy-mode 1))
  :config
  (:bind lispy-mode ":" self-insert-command)
  (:bind lispy-mode "[" lispy-open-square)
  (:bind lispy-mode "]" lispy-close-square))

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :config (setq markdown-command "multimarkdown"))

(use-package elpy)

(use-package jedi
  :init
  (progn
    (:hook python-mode jedi:setup)
    (setq jedi:complete-on-dot t)))

(use-package js2-mode
  :config
  (:push auto-mode-alist '("\\.js\\'" . js2-mode))
  (:hook js2-mode js2-imenu-extras-mode)
  (define-key js2-mode-map (kbd "C-k") #'js2r-kill)
  (define-key js-mode-map (kbd "M-.") nil)
  (setq js2-include-node-externs t)
  (setq js2-include-browser-externs t))

(use-package xref-js2
  :config
  (:hook js2-mode
    (:hook xref-backend-functions :local xref-js2-xref-backend)))

(use-package js2-refactor
  :config
  (:hook js2-mode js2-refactor-mode)
  (js2r-add-keybindings-with-prefix "C-c C-r"))

(use-package company-tern
  :config
  (setq tern-command '("npx" "tern"))
  (:push company-backends 'company-tern)
  (:hook js2-mode
    (tern-mode)
    (company-mode))

  ;; Disable completion keybindings, as we use xref-js2 instead
  (define-key tern-mode-keymap (kbd "M-.") nil)
  (define-key tern-mode-keymap (kbd "M-,") nil))

(use-package typescript-mode
  :config
  (flycheck-add-mode 'typescript-tslint 'web-mode))

(defun setup-tide-mode ()
  (interactive)
  (direnv-mode)
  (direnv-update-environment)
  (tide-setup)
  (flycheck-mode +1)
  (setq flycheck-check-syntax-automatically '(save mode-enabled))
  (setq tide-hl-identifier-idle-time 0.0)
  (eldoc-mode +1)
  (tide-hl-identifier-mode +1)
  (company-mode +1))

(use-package tide
  :config
  (:hook before-save tide-format-before-save)
  (:hook typescript-mode setup-tide-mode)
  (:push auto-mode-alist '("\\.tsx\\'" . web-mode))
  (:hook web-mode
    (when (string-equal "tsx" (file-name-extension buffer-file-name))
      (setup-tide-mode)))

  (:hook web-mode
    (when (string-equal "tsx" (file-name-extension buffer-file-name))
      (setup-tide-mode)))

  (flycheck-add-mode 'typescript-tslint 'web-mode))

(defun tide-cleanup-imports ()
  (interactive)
  (save-excursion
    (tide-organize-imports)
    (beginning-of-buffer)
    (while (search-forward-regexp "^import[[:space:]]+[[:alpha:]{},[:space:]]+\"" nil t)
      (embrace--insert ?\' (embrace--delete ?\" t)))
    (beginning-of-buffer)
    (when (search-forward-regexp "^import[[:space:]]+[[:alpha:]{},[:space:]]+\'[^[:alpha:]]" nil t)
      (beginning-of-line)
      (open-line 1))
    (progn
      (beginning-of-buffer)
      ;; search for first non-import line
      (while (or
              (string-match "\\(^import\\|^//\\)" (thing-at-point 'line t))
              (string-equal "\n" (thing-at-point 'line t)))
        (end-of-line)
        (forward-char))

      ;; delete all preceeding whitespace
      (while (progn (beginning-of-line)
                    (backward-char)
                    (beginning-of-line)
                    (string-equal "\n" (thing-at-point 'line t)))
        (kill-line))
      (end-of-line)
      (forward-char)
      (open-line 2))
    (tide-format)))

(use-package nim-mode)

(use-package yaml-mode
  :config
  (:push auto-mode-alist '("\\.yml\\'" . yaml-mode)))
