unmanaged/emacs/init.el

(use-package prettier-js
  :config
  (setq prettier-js-args '("--tab-width" "4" "--trailing-comma" "all")))

(use-package add-node-modules-path)

(use-package json-mode
  :straight (json-mode :type git
                       :host github
                       :repo "kiennq/json-mode"
                       :branch "feat/jsonc-mode")
  :config
  (setf auto-mode-alist (assoc-delete-all "\\(?:\\(?:\\.\\(?:b\\(?:\\(?:abel\\|ower\\)rc\\)\\|json\\(?:ld\\)?\\)\\|composer\\.lock\\)\\'\\)" auto-mode-alist))
  (setf auto-mode-alist (assoc-delete-all "\\.json\\'" auto-mode-alist))
  (:push auto-mode-alist '("\\.json\\'" . jsonc-mode)))

(defun org-babel-execute:jsonc (body params)
  "Execute a block of jsonc with org-babel."
  body)

(defun org-babel-execute:json (body params)
  "Execute a block of json with org-babel."
  body)

(use-package web-mode
  :demand t
  :config
  (:push auto-mode-alist '("\\.tsx\\'" . web-mode))
  (:push auto-mode-alist '("\\.jsx\\'" . web-mode))
  (:push auto-mode-alist '("\\.html?\\'" . web-mode))
  (:push web-mode-engines-alist '(("django"    . "\\.html\\'")))
  (:hook web-mode (progn (prettier-js-mode)
                         (setq web-mode-markup-indent-offset 4)))
  (setq web-mode-content-types-alist '(("jsx" . "\\.js[x]?\\'")))
  (setq-default flycheck-disabled-checkers
                (append flycheck-disabled-checkers
                        '(javascript-jshint json-jsonlist)))
  (flycheck-add-mode 'javascript-eslint 'web-mode)
  (add-hook 'after-init-hook #'global-flycheck-mode)
  (add-hook 'flycheck-mode-hook 'add-node-modules-path))

(use-package go-mode
  :config (:hook go-mode
            (:hook before-save gofmt-before-save)
            (setq tab-width 4)
            (setq indent-tabs-mode 1)))

(use-package csharp-mode)

(:hook csharp-mode :local
  (company-mode)
  (flycheck-mode)

  (setq c-syntactic-indentation t)
  (c-set-style "ellemtel")
  (setq c-basic-offset 4)
  (setq truncate-lines t)
  (setq tab-width 4)

  (electric-pair-local-mode 1))

(use-package fsharp-mode
  :config
  (require 'eglot)
  (:push auto-mode-alist '("\\.fs[iylx]?$" . fsharp-mode)))

(use-package dockerfile-mode
  :mode "Dockerfile\\'")

(use-package nix-mode
  :straight (nix-mode :type git :host github :repo "NixOS/nix-mode")
  :mode "\\.nix\\'"
  :config
  (remove-hook 'before-save-hook #'nix-mode-format))

(use-package nix-sandbox)

(defun advice-unadvice (sym)
  "Remove all advices from symbol SYM."
  (interactive "aFunction symbol: ")
  (advice-mapc (lambda (advice _props) (advice-remove sym advice)) sym))

(defun elfeed-font-size-hook ()
  (buffer-face-set '(:height 1.35)))

(defun elfeed-visual-fill-hook ()
  (visual-fill-column-mode--enable))

(defun elfeed-show-refresh-advice (entry)
  (elfeed-font-size-hook)
  (visual-fill-column-mode 1)
  (setq word-wrap 1)
  (elfeed-show-refresh))

(defun elfeed-show ()
  (interactive)
  (elfeed)
  (delete-other-windows))

(use-package elfeed
  :bind (("C-x w" . elfeed-show))
  :config
  (:hook elfeed-search-update elfeed-font-size-hook)
  (advice-unadvice 'elfeed-show-entry)
  (advice-add 'elfeed-show-entry :after 'elfeed-show-refresh-advice))

(use-package elfeed-org
  :after (elfeed)
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files (list (my/get-org-file "notes.org"))))

(use-package embrace
  :config
  (embrace-add-pair (kbd "\;") "`" "`"))

(use-package htmlize)

(use-package emacsql-sqlite)

(use-package gist
  :straight (gist :type git :host github :repo "defunkt/gist.el"))

(use-package poker
  :straight (poker :type git :host github :repo "mlang/poker.el"))

(use-package decide
  :straight (decide :type git :host github :repo "lifelike/decide-mode"))

;; (eval `(use-package sutysisku
;;    :demand t
;;    :straight (sutysisku :local-repo ,(my/get-project-directory "sutysisku.el/"))))

(use-package plantuml-mode
  :config
  (setq plantuml-jar-path "/nix/store/slmi57xig7mbif52sf757arx5sbj2bni-plantuml-1.2020.15/lib/plantuml.jar")
  (setq plantuml-default-exec-mode 'jar))

(use-package pretty-hydra
  :demand t
  :straight (pretty-hydra :type git :host github
                          :repo "jerrypnz/major-mode-hydra.el"
                          :branch "c6554ea"
                          :files ("pretty-hydra.el")))

(use-package major-mode-hydra
  :straight (major-mode-hydra :type git :host github
                              :repo "jerrypnz/major-mode-hydra.el"
                              :branch "c6554ea"
                              :files ("major-mode-hydra.el")))

(use-package hera
  :demand t
  :straight (hera :type git :host github :repo "dustinlacewell/hera"))

(defun :hydra/inject-hint (symbol hint)
  (-let* ((name (symbol-name symbol))
          (hint-symbol (intern (format "%s/hint" name)))
          (format-form (eval hint-symbol))
          (string-cdr (nthcdr 1 format-form))
          (format-string (string-trim (car string-cdr)))
          (amended-string (format "%s\n\n%s" format-string hint)))
    (setcar string-cdr amended-string)))

(defun :hydra/make-head-hint (head default-color)
  (-let (((key _ hint . rest) head))
    (when key
      (-let* (((&plist :color color) rest)
              (color (or color default-color))
              (face (intern (format "hydra-face-%s" color)))
              (propertized-key (propertize key 'face face)))
        (format " [%s]: %s" propertized-key hint)))))

(defun :hydra/make-hint (heads default-color)
  (string-join
   (cl-loop for head in heads
            for hint = (:hydra/make-head-hint head default-color)
            do (pp hint)
            collect hint) "\n"))

(defun :hydra/clear-hint (head)
  (-let* (((key form _ . rest) head))
    `(,key ,form nil ,@rest)))

(defun :hydra/add-exit-head (heads)
  (let ((exit-head '("SPC" (hera-pop) "to exit" :color blue)))
    (append heads `(,exit-head))))

(defun :hydra/add-heads (columns extra-heads)
  (let* ((cell (nthcdr 1 columns))
         (heads (car cell))
         (extra-heads (mapcar ':hydra/clear-hint extra-heads)))
    (setcar cell (append heads extra-heads))))
