unmanaged/emacs/init.org
*** macro
#+begin_src emacs-lisp
    (defmacro :hydra (name body columns &optional extra-heads)
      (declare (indent defun))
      (-let* (((&plist :color default-color :major-mode mode) body)
              (extra-heads (:hydra/add-exit-head extra-heads))
              (extra-hint (:hydra/make-hint extra-heads default-color))
              (body (plist-put body :hint nil))
              (body-name (format "%s/body" (symbol-name name)))
              (body-symbol (intern body-name))
              (mode-body-name (major-mode-hydra--body-name-for mode))
              (mode-support
               `(when ',mode
                  (defun ,mode-body-name () (interactive) (,body-symbol)))))
        (:hydra/add-heads columns extra-heads)
        (when mode
          (cl-remf body :major-mode))
        `(progn
           (pretty-hydra-define ,name ,body ,columns)
           (:hydra/inject-hint ',name ,extra-hint)
           ,mode-support
           )))
#+end_src

*** tests
#+begin_src emacs-lisp
    ;; (macroexpand-all `(:hydra hydra-test (:color red :major-mode fundamental-mode)
    ;;    ("First"
    ;;     (("a" (message "first - a") "msg a" :color blue)
    ;;      ("b" (message "first - b") "msg b"))
    ;;     "Second"
    ;;     (("c" (message "second - c") "msg c" :color blue)
    ;;      ("d" (message "second - d") "msg d")))))

    ;; (:hydra hydra-test (:color red :major-mode fundamental-mode)
    ;;    ("First"
    ;;     (("a" (message "first - a") "msg a" :color blue)
    ;;      ("b" (message "first - b") "msg b"))
    ;;     "Second"
    ;;     (("c" (message "second - c") "msg c" :color blue)
    ;;      ("d" (message "second - d") "msg d"))))

#+end_src

* default hydra
** hydra-bookmarks
#+begin_src emacs-lisp
  (:hydra hydra-bookmarks (:color blue)
    ("Bookmarks" (("n" (linkmarks-capture) "new")
                  ("b" (linkmarks-select) "browse")
                  ("e" (find-file my/bookmarks-file-name)))))
#+end_src
** hydra-help
Many of the Emacs help facilities at your fingertips!

#+begin_src emacs-lisp

  (:hydra hydra-help (:color blue)
    ("Describe"
     (("c" describe-function "function")
      ("p" describe-package "package")
      ("m" describe-mode "mode")
      ("v" describe-variable "variable"))
     "Keys"
     (("k" describe-key "key")
      ("K" describe-key-briefly "brief key")
      ("w" where-is "where-is")
      ("b" helm-descbinds "bindings"))
     "Search"
     (("a" helm-apropos "apropos")
      ("d" apropos-documentation "documentation")
      ("s" info-lookup-symbol "symbol info"))
     "Docs"
     (("i" info "info")
      ("n" helm-man-woman "man")
      ("h" helm-dash "dash"))
     "View"
     (("e" view-echo-area-messages "echo area")
      ("l" view-lossage "lossage")
      ("c" describe-coding-system "encoding")
      ("I" describe-input-method "input method")
      ("C" describe-char "char at point"))))
#+end_src

** hydra-mark
#+begin_src emacs-lisp
  (defun unpop-to-mark-command ()
    "Unpop off mark ring. Does nothing if mark ring is empty."
    (when mark-ring
      (setq mark-ring (cons (copy-marker (mark-marker)) mark-ring))
      (set-marker (mark-marker) (car (last mark-ring)) (current-buffer))
      (when (null (mark t)) (ding))
      (setq mark-ring (nbutlast mark-ring))
      (goto-char (marker-position (car (last mark-ring))))))

  (defun push-mark ()
    (interactive)
    (set-mark-command nil)
    (set-mark-command nil))

  (:hydra hydra-mark (:color pink)
    ("Mark"
     (("m" push-mark "mark here")
      ("p" (lambda () (interactive) (set-mark-command '(4))) "previous")
      ("n" (lambda () (interactive) (unpop-to-mark-command)) "next")
      ("c" (lambda () (interactive) (setq mark-ring nil)) "clear"))))
#+end_src

** hydra-registers
#+begin_src emacs-lisp
  (:hydra hydra-registers (:color pink)
    ("Point"
     (("r" point-to-register "save point")
      ("j" jump-to-register "jump")
      ("v" view-register "view all"))
     "Text"
     (("c" copy-to-register "copy region")
      ("C" copy-rectangle-to-register "copy rect")
      ("i" insert-register "insert")
      ("p" prepend-to-register "prepend")
      ("a" append-to-register "append"))
     "Macros"
     (("m" kmacro-to-register "store")
      ("e" jump-to-register "execute"))))

#+end_src

** hydra-window
#+begin_src emacs-lisp
  (use-package ace-window)
  (winner-mode 1)

  (:hydra hydra-window (:color red)
    ("Jump"
     (("h" windmove-left "left")
      ("l" windmove-right "right")
      ("k" windmove-up "up")
      ("j" windmove-down "down")
      ("a" ace-select-window "ace"))
     "Split"
     (("q" split-window-right "left")
      ("r" (progn (split-window-right) (call-interactively 'other-window)) "right")
      ("e" split-window-below "up")
      ("w" (progn (split-window-below) (call-interactively 'other-window)) "down"))
     "Do"
     (("d" delete-window "delete")
      ("o" delete-other-windows "delete others")
      ("u" winner-undo "undo")
      ("R" winner-redo "redo")
      ("t" nougat-hydra-toggle-window "toggle"))))
#+end_src

** hydra-zoom
#+begin_src emacs-lisp
  (:hydra hydra-zoom (:color red)
    ("Buffer"
     (("i" text-scale-increase "in")
      ("o" text-scale-decrease "out"))
     "Frame"
     (("I" zoom-frm-in "in")
      ("O" zoom-frm-out "out")
      ("r" toggle-zoom-frame "reset" :color blue))))
#+end_src

** hydra-nix
#+begin_src emacs-lisp
  (:hydra hydra-nix (:color blue)
    ("Nix" (("p" (progn (find-file (my/get-org-file "nixpkgs.org"))
                        (helm-org-in-buffer-headings)
                        (recenter-top-bottom 1)
                        (org-narrow-to-subtree)
                        (sit-for 5)
                        (widen)) "nixpkgs"))))
#+end_src

** hydra-docs
#+begin_src emacs-lisp
  (:hydra hydra-docs (:color blue)
    ("Docs" (("n" (hera-push 'hydra-nix/body) "Nix"))))
#+end_src
** hydra-notes
#+begin_src emacs-lisp
  (require 'helm-org-walk)

  (:hydra hydra-notes (:color blue)
    ("Notes"
     (("o" (helm-org-walk '(4)) "open")
      ("s" (helm-org-rifle-org-directory) "search")
      ("S" (helm-org-rifle-occur-org-directory) "occur")
      ("q" (helm-org-ql-org-directory) "query")
      ("n" (helm-org-walk my/notes-file-name) "notes"))))
#+end_src

** hydra-gist
#+begin_src emacs-lisp
  (:hydra hydra-gist (:color blue)
    ("Gist" (("p" (gist-region-or-buffer) "public")
             ("P" (gist-region-or-buffer-private) "private")
             ("b" (browse-url "https://gist.github.com/dustinlacewell") "browse"))))
#+end_src

** hydra-projectile
#+begin_src emacs-lisp
  (:hydra hydra-projectile (:color blue)
    ("Open"
     (("o" (helm-projectile-switch-project) "project")
      ("p" (helm-projectile) "project asset")
      ("f" (helm-projectile-find-file-dwim) "file")
      ("b" (helm-projectile-switch-to-buffer) "buffer")
      ("r" (projectile-readme) "readme")
      ("w" (hydra-treemacs/body) "workspace"))
     "Do"
     (("s" (helm-projectile-ag) "search")
      ("c" (org-projectile-helm-template-or-project) "capture"))
     "Cache"
     (("C" projectile-invalidate-cache "clear cache")
      ("x" (projectile-remove-known-project) "remove this project")
      ("X" (projectile-cleanup-known-projects) "cleanup missing"))))
#+end_src

** hydra-default
#+begin_src emacs-lisp
  (:hydra hydra-default (:color blue)
    ("Open"
     (("a" (org-agenda nil "a") "agenda")
      ("p" (hera-push 'hydra-projectile/body) "projectile")
      ("o" (hera-push 'hydra-notes/body) "org")
      ("j" (call-interactively 'org-journal-new-entry) "new journal entry")
      ("J" (org-journal-new-entry '(4)) "open journal")
      ("b" (hera-push 'hydra-bookmarks/body) "bookmarks"))
     "Emacs"
     (("h" (hera-push 'hydra-help/body) "help")
      ("m" (hera-push 'hydra-mark/body) "mark")
      ("w" (hera-push 'hydra-window/body) "windows")
      ("z" (hera-push 'hydra-zoom/body) "zoom")
      ("r" (hera-push 'hydra-registers/body) "registers"))
     "Misc"
     (("d" (hera-push 'hydra-docs/body) "docs")
      ("g" (hera-push 'hydra-gist/body) "gist")
      (";" embrace-commander "embrace"))))
#+end_src

* modal hydras
** boilerplate
