unmanaged/emacs/init.org
*** hydra-dwim
Open hydra for current major mode if one exists, otherwise the default hydra.
#+begin_src emacs-lisp
  (defun my/hydra-dwim ()
    (interactive)
    (let* ((mode major-mode)
          (orig-mode mode))
      (catch 'done
        (while mode
          (let ((hydra (major-mode-hydra--body-name-for mode)))
            (when (fboundp hydra)
              (hera-start hydra)
              (throw 'done t)))
          (setq mode (get mode 'derived-mode-parent)))
        (hera-start 'hydra-default/body))))
#+end_src
** hydra-yank-pop
#+begin_src emacs-lisp
  (:hydra hydra-yank-pop (:color red)
    ("Yank/Pop"
     (("y" (yank-pop 1) "previous")
      ("Y" (yank-pop -1) "next")
      ("l" helm-show-kill-ring "list" :color blue))))

  (:bind "C-y"
    (yank)
    (hydra-yank-pop/body))
#+end_src

** hydra-elisp
#+begin_src emacs-lisp
  (:hydra hydra-elisp (:color blue :major-mode emacs-lisp-mode)
    ("Execute"
     (("d" eval-defun "defun")
      ("b" eval-current-buffer "buffer")
      ("r" eval-region "region"))
     "Debug"
     (("D" edebug-defun "defun")
      ("a" edebug-all-defs "all definitions" :color red)
      ("A" edebug-all-forms "all forms" :color red)
      ("x" macrostep-expand "expand macro"))))
#+end_src

** hydra-tide
#+begin_src emacs-lisp
  (:hydra hydra-tide (:color blue :major-mode typescript-mode)
    ("Server"
     (("r" tide-restart-server "restart")
      ("k" tide-kill-server "kill")
      ("C" tide-do-cleanups "cleanup"))
     "Actions"
     (("f" tide-fix "fix")
      ("F" tide-cleanup-imports "format")
      ("r" tide-references "references")
      ("R" tide-rename-symbol "rename")
      ("e" tide-refactor "extract"))
     "Errors"
     (("p" tide-error-at-point "error at point")
      ("P" tide-project-errors "project errors"))))
#+end_src

** hydra-treemacs
#+begin_src emacs-lisp
  (:hydra hydra-treemacs (:color red)
    ("Workspace"
     (("o" treemacs-switch-workspace "open")
      ("n" treemacs-create-workspace "new")
      ("k" treemacs-delete-workspace "kill")
      ("r" treemacs-rename-workspace "rename"))))
#+end_src
** hydra-org
*** hydra-org-goto-first-sibling
#+begin_src emacs-lisp
  (defun hydra-org-goto-first-sibling () (interactive)
         (org-backward-heading-same-level 99999999))
#+end_src

*** hydra-org-goto-last-sibling
#+begin_src emacs-lisp
  (defun hydra-org-goto-last-sibling () (interactive)
         (org-forward-heading-same-level 99999999))
#+end_src

*** hydra-org-parent-level
#+begin_src emacs-lisp
  (defun hydra-org-parent-level ()
    (interactive)
    (let ((o-point (point)))
      (if (save-excursion
            (beginning-of-line)
            (looking-at org-heading-regexp))
          (progn
            (call-interactively 'outline-up-heading)
            (org-cycle-internal-local))
        (progn
          (call-interactively 'org-previous-visible-heading)
          (org-cycle-internal-local)))
      (when (and (/= o-point (point))
                 org-tidy-p)
        (call-interactively 'hydra-org-tidy))))

 #+end_src

*** hydra-org-child-level
#+begin_src emacs-lisp
  (defun hydra-org-child-level ()
    (interactive)
    (org-show-entry)
    (org-show-children)
    (when (not (org-goto-first-child))
      (when (save-excursion
              (beginning-of-line)
              (looking-at org-heading-regexp))
        (next-line))))
#+end_src

*** hydra-org
 #+begin_src emacs-lisp
   (:hydra hydra-org (:color red :major-mode org-mode)
     ("Shift"
      (("K" org-move-subtree-up "up")
       ("J" org-move-subtree-down "down")
       ("h" org-promote-subtree "promote")
       ("l" org-demote-subtree "demote"))
      "Travel"
      (("p" org-backward-heading-same-level "backward")
       ("n" org-forward-heading-same-level "forward")
       ("j" hydra-org-child-level "to child")
       ("k" hydra-org-parent-level "to parent")
       ("a" hydra-org-goto-first-sibling "first sibling")
       ("e" hydra-org-goto-last-sibling "last sibling"))
      "Perform"
      (("t" (org-babel-tangle) "tangle" :color blue)
       ("e" (org-html-export-to-html) "export" :color blue)
       ("b" helm-org-in-buffer-headings "browse")
       ("r" (lambda () (interactive)
              (helm-org-rifle-current-buffer)
              (org-cycle)
              (org-cycle)) "rifle")
       ("w" helm-org-walk "walk")
       ("v" avy-org-goto-heading-timer "avy")
       ("L" org-toggle-link-display "toggle links"))))
#+end_src

** hydra-js
#+begin_src emacs-lisp
  (defun js2r-toggle-async ()
    (interactive)
    (if (string-equal "async" (thing-at-point 'word))
        (progn
          (search-forward "function")
          (backward-word)))
    (js2r-toggle-function-async))

  (:hydra hydra-js (:color blue :major-mode js2-mode)
    ("Eval"
     (("f" js2-eval-defun "function")
      ("e" js2-eval "expression"))
     "Extract"
     (("f" js2r-extract-function "function")
      ("m" js2r-extract-method "method")
      ("v" js2r-extract-var "var")
      ("l" js2r-extract-let "let")
      ("c" js2r-extract-let "const"))
     "Funcs"
     (("a" js2r-toggle-arrow-function-and-expression "arrow" :color red)
      ("A" js2r-toggle-async "async" :color red)
      ("O" js2r-arguments-to-object "object param"))
     "Vars"
     (("r" js2r-rename-var "rename")
      ("i" js2r-inline-var "inline"))
     "Misc"
     (("k" js2r-kill "kill" :color red)
      ("t" js2r-string-to-template "string to template")
      ("l" js2r-log-this "log expr")
      ("w" js2r-wrap-buffer-in-iife "wrap in iife")
      ("G" js2r-inject-global-in-iife "global for iife"))))
#+end_src

* linux configuration
** preamble
#+begin_src emacs-lisp
  (when (string-equal system-type "gnu/linux")
#+end_src

** nixos
NixOS' ZSH module drops some PATH modification stuff in =~/.config/zsh/.zshrc=
which causes the following message on startup:

#+begin_src
  You appear to be setting environment variables ("PATH") in your .bashrc or .zshrc:
  those files are only read by interactive shells, so you should instead set
  environment variables in startup files like .profile, .bash_profile or .zshenv.
  Refer to your shell's man page for more info.

  Customize `exec-path-from-shell-arguments` to remove "-i" when done, or disable
  `exec-path-from-shell-check-startup-files` to disable this message.
#+end_src

The following line prevents the warning above:

#+begin_src emacs-lisp
  (setq exec-path-from-shell-check-startup-files nil)
#+end_src

** theme
#+begin_src emacs-lisp
  (load-file "~/.config/wpg/templates/theme.el")
  (enable-theme 'xresources)
  ;; (use-package dracula-theme
  ;;   :config (enable-theme 'dracula))
#+end_src

*** automatically update theme
#+begin_src emacs-lisp
  (defun theme-callback (event)
    (load-file "~/.config/wpg/templates/theme.el")
    (enable-theme 'xresources))

  (require 'filenotify)
  (setq theme-watch-handle
        (file-notify-add-watch
         "/home/ldlework/.config/wpg/templates/theme.el" '(change) 'theme-callback))
#+end_src

*** default font
#+begin_src emacs-lisp
  (setq powerline-height 32)
  (set-face-attribute 'default nil :family "New Times Roman" :weight 'light)
#+end_src

*** unicode fonts
#+begin_src emacs-lisp
  (use-package unicode-fonts
    :config
    (unicode-fonts-setup)
    (set-face-attribute 'default nil :font "Source Code Pro")
    ;(set-fontset-font "fontset-default" 'unicode "Consolas" nil)
    (set-fontset-font "fontset-default" 'unicode "DejaVu Sans Mono" nil)
    (set-fontset-font "fontset-default" 'unicode "Symbola" nil)
   )
#+end_src

** core
*** minor modes
**** ispell-minor-mode
#+begin_src emacs-lisp
  (setq ispell-program-name (concat my/home-directory ".nix-profile/bin/aspell"))
#+end_src

*** fix tooltips
#+begin_src emacs-lisp
  (setq x-gtk-use-system-tooltips nil)
#+end_src

** helm
*** theme customizations
#+begin_src emacs-lisp
  ;; (set-face-attribute
  ;;  'helm-selection nil
  ;;  :inherit t
  ;;  :background (theme-color 'blue)
  ;;  :foreground (theme-color 'background)
  ;;  :height 1.0
  ;;  :weight 'ultra-bold
  ;;  :inverse-video nil)

  ;; (set-face-attribute
  ;;  'helm-source-header nil
  ;;  :inherit nil
  ;;  :underline nil
  ;;  :background (theme-color 'background)
  ;;  :foreground (theme-color 'light-red)
  ;;  :height 1.9)

  ;; (set-face-attribute
  ;;  'helm-header nil
  ;;  :inherit nil
  ;;  :height 0.8
  ;;  :background (theme-color 'background)
  ;;  :foreground (theme-color 'cyan))

  ;; (set-face-attribute
  ;;  'helm-separator nil
  ;;  :height 0.8
  ;;  :foreground (theme-color 'light-red))

  ;; (set-face-attribute
  ;;  'helm-match nil
  ;;  :weight 'bold
  ;;  :foreground (theme-color 'green))

#+end_src

*** filter nix wrappers
#+begin_src emacs-lisp
(require 'helm-external)
(setq helm-external-commands-list
      (seq-filter (lambda (v) (not (string-match "^\\." v)))
                  (helm-external-commands-list-1 'sort)))
#+end_src

** postamble
#+begin_src emacs-lisp
  

  )
#+end_src

*** csharp
