unmanaged/emacs/init.org
**** omnisharp
#+begin_src emacs-lisp
  (use-package omnisharp)

  (:after company
    (:push company-backends #'company-omnisharp))

  (defun my-linux-csharp-mode-setup ()
    (omnisharp-mode)
    (local-set-key (kbd "C-c r r") 'omnisharp-run-code-action-refactoring)
    (local-set-key (kbd "C-c C-c") 'recompile))

  (:hook csharp-mode my-linux-csharp-mode-setup t)
#+end_src

* windows configuration
** preamble
#+begin_src emacs-lisp
  (when (string-equal system-type "windows-nt")
#+end_src

** theme
#+begin_src emacs-lisp
  (use-package dracula-theme)
#+end_src

** postamble
#+begin_src emacs-lisp
)
#+end_src

* postfix
#+html_head: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+html_head: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+html_head: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+html_head: <script type="text/javascript" src="https://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>
#+html_head: <link rel="stylesheet" href="https://raw.githubusercontent.com/gongzhitaao/orgcss/master/src/css/org.css">
#+NAME: startup
#+begin_src emacs-lisp
  (setq org-html-htmlize-output-type 'css)
  (setq org-html-head-include-default-style nil)
#+end_src

#+RESULTS: startup

#+begin_export html
<style>
h1 {
    font-size: 2.5em;
}

h2 {
    font-size: 2.3em;
    border-bottom: 1px solid black;
}

h3 {
    content: "\25CB";
    margin-right: .3em;
}
</style>
#+end_export

# Local Variables:
# eval: (progn (org-babel-goto-named-src-block "startup") (org-babel-execute-src-block) (outline-hide-sublevels 1))
# End:
