unmanaged/emacs/init.el

(use-package omnisharp)

(:after company
  (:push company-backends #'company-omnisharp))

(defun my-linux-csharp-mode-setup ()
  (omnisharp-mode)
  (local-set-key (kbd "C-c r r") 'omnisharp-run-code-action-refactoring)
  (local-set-key (kbd "C-c C-c") 'recompile))

(:hook csharp-mode my-linux-csharp-mode-setup t)

(when (string-equal system-type "windows-nt")

(use-package dracula-theme)

)

(setq org-html-htmlize-output-type 'css)
(setq org-html-head-include-default-style nil)
